---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralS.#ctor(System.Double,System.Double,System.Double,Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams)
source: html/7b419d4b-2c3e-17f1-51e6-8b89980a065a.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralS.#ctor Method

Creates a new instance of Round Bar shape.

## Syntax (C#)
```csharp
public StructuralSectionGeneralS(
	double diameter,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams analysisParams
)
```

## Parameters
- **diameter** (`System.Double`) - Pipe Diameter.
- **centroidHorizontal** (`System.Double`) - Distance from centroid to the left extremites along horizontal axis.
- **centroidVertical** (`System.Double`) - Distance from centroid to the upper extremites along vertical axis.
- **analysisParams** (`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams`) - Common set of parameters for structural analysis.